// Задача 40. Теорема о неравенстве треугольника. Принимаем на вход 3 числа.

// Console.Write("Enter A: ");
// int A = int.Parse(Console.ReadLine()!);
// Console.Write("Enter B: ");
// int B = int.Parse(Console.ReadLine()!);
// Console.Write("Enter C: ");
// int C = int.Parse(Console.ReadLine()!);
// if(A < (B+C) & B < (A+C) & C < (A+B)) 
// Console.Write("Можно составить треугольник");
// else 
// Console.Write("Нельзя составить треугольник");

//Задача 42. Преобразовать десятичное число в двоичное
// Console.Write("Enter number: ");
// int num = int.Parse(Console.ReadLine()!);
// int remains = 0;
// string res = string.Empty;
// while (num > 0)
// {
//     remains = num % 2;
//     res = remains + res;
//     num = num /2;
// }
// Console.WriteLine(res);

//Задача 44. 